#秘书账号状态
userstatus = {
    '0':'正式',
    '1':'试用',
    '2':'停用',
    '3':'停用',
    '4':'停用',
    '5':'停用',
    '-1':'弃用',
}

# 秘书账号类型
usergenre = {
             '0':'用户',
             '1':'员工',
             '2':'测试',
             '3':'系统用户',
             '4':'代理商用户',
             '5':'预警用户',
             '6':'项目用户'}


# 拜访类型映射
entity_type_map = {
    '-10': '任务',
    '-11': '快速记录',
    '-12': '短信',
    '4173078': '电话拜访',
    '4173079': '签到拜访',
    '4283365': '跟进记录'
}


# 客户级别
customer_level_map = {
    '1':'重点',
    '4':'开发',
    '5':'正式',
    None:'其他'
}


# 客户状态 是否公海池
highSeaStatus = {
    '非公海池':'1,3,4'
}

# 商机的业务类型 商机表 entityType
opp_entityType = {
    '4173071':'产品新单',
    '4224588':'产品续单',
    '6691066':'项目型业务',
    '7285322':'星光数据',
    '1135777961230727':'代理商商机'
}

#商机采购报告提交流程  商机表 dbcSelect18
opp_purchase_report_process = {
    '1':'准备采购报告',
    '2':'分管决策人同意',
    '3':'一把手同意',
    '4':'上会讨论通过',
    '5':'未通过客户内部审核'
}
#商务推进堵点  商机表 custCheckbox4
opp_business_plugging = {
    '1':'价格问题',
    '2':'第三方因素',
    '3':'遇到竞品',
    '4':'政策因素',
    '5':'潜在需求满足'
}
#合同推进堵点  商机表 custCheckbox2
opp_contract_plugging = {
    '1':'合同条款',
    '2':'价格',
    '3':'付款方式',
    '4':'客户人员内部调整',
    '5':'预算不到位',
    '6':'其他最终影响最终签约问题',
    '7':'无堵点',
}
#需求推进堵点  商机表 custCheckbox1
opp_needs_plugging = {
    '1':'产品功能',
    '2':'担心检测效果',
    '3':'价格问题',
    '4':'时机不成熟',
    '5':'担心安全',
    '6':'第三方因素',
    '7':'遇到竞品',
    '8':'政策因素',
    '9':'其它',
    '10':'无堵点',
}
#招标情况  商机表 dbcSelect17
opp_bids = {
    '1':'不走招投标',
    '2':'编写招标文件',
    '3':'公布招标文件',
    '4':'投标',
    '5':'中标通知',
    '6':'未中标',
}
#逾期续单原因  商机表 dbcSelect13
overdue_renew = {
    '1':'可以续单',
    '2':'换领导',
    '3':'无经费',
    '4':'无职能',
    '5':'竞品影响',
    '6':'产品问题',
    '7':'代理商签约',
    '8':'需求薄弱',
    '9':'内部改制',
    '10':'价格原因',
}
#报价单审批状态 报价单表 approvalStatus
quote_approve = {
    '0':'待提交',
    '1':'审批中',
    '2':'审批拒绝',
    '3':'审批通过',
}

#商机对应  订单表的合同状态  dbcSelect3
contract_status = {
    '1':'合同发出',
    '4':'合同归档执行',
    '7':'合同归档作废',
    '6':'合同发出作废',
    '2':'合同发出变更',
    '3':'合同归档终止',
    '5':'合同归档变更',
}

# 商机阶段
opp_sale_step = {

    '1172739':'产品新单-潜在商机(新)',

    '1172741':'产品新单-商机确认(新)',

    '1186830':'产品新单-商务谈判(新)',

    '1172743':'产品新单-合同确认(新)',

    '1209860':'产品新单-赢单（新）',

    '1172744':'产品新单-输单(新)',

    '1186615':'产品续单-商机确认（续）',

    '1197988':'产品续单-商务谈判（续）',

    '1186616':'产品续单-合同确认（续）',

    '1595051':'产品续单-赢单（续）',

    '1186617':'产品续单-输单（续）',

    '1723501':'项目型业务-初步沟通（项目）',

    '1723502':'项目型业务-意向客户（项目）',

    '1723701':'项目型业务-商机确认（项目）',

    '1723503':'项目型业务-需求确认（项目）',

    '1723504':'项目型业务-商务谈判（项目）',

    '1723003':'项目型业务-合同确认（项目）',

    '1723505':'项目型业务-赢单（项目）',

    '1723506':'项目型业务-输单（项目）',

    '1850762':'星光数据-初步沟通（数据）',

    '1850763':'星光数据-需求确认（数据）',

    '1850764':'星光数据-商务谈判（数据）',

    '1850765':'星光数据-合同确认（数据）',

    '1850766':'星光数据-赢单（数据）',

    '1850767':'星光数据-输单（数据）',

    '1135781124718946':'代理商商机-输单',
}

# 签到拜访的问题类型 Sales_portrait_activity 表 problem_type字段
problem_content = {
                    '1':'无客户经纬度,无法计算签到距离',
                    '2':'签到拜访时没有定位经纬度',
                    '3':'签到位置距离客户超过10公里',
                    None: '无问题'
                   }

problem_content1 = {
                    '1':'无客户经纬度,无法计算签到距离',
                    '2':'签到拜访时没有定位经纬度',
                    '3':'签到位置距离客户超过10公里',
                    '4':'经计算判断为签到问题',
                    '0': '无问题'
                   }

SaleSure = {
    1:'承诺',
    2:'争取',
    4:'跟进'

}


# task entityBelongId 对应 表明   不全
task_belongid_dict={
    "1": "account" ,
    "2": "联系人",
    "3": "opportunity",
    "11": "销售线索",
    "6": " 市场活动",
    "35": "订单",
    "15": "协议",
    "100374689": "FAQ",
    "100374884": "试用账号申请",
    "100374943": "业绩拆分",
    "100375036": "外采业务",
    "100375115": "满意度",
    "100375233": "项目立项",
    "100375350": "服务工单",
    "100377226": "拆分明细",
    "100382033": "实施进度表",
    "100382195": "账号申请",
    "100382682": "订单变更",
    "100382828": "外采明细",
    "100383923": "退票申请",
    "100384016": "开票申请",
    "100392313": "联系记录",
    "100404621": "境外数据申请",
    "100444947": " 项目预算明细 ",
    "100463897": " 项目售前支持申请 ",
    "100550222": " 项目费用明细 ",
    "100550601": " 项目费用支付＆报销 ",
    "100667195": " 业务商机 ",
}

# 任务状态
task_status={
    "1": "进行中",
    "2": "已完成",
    "3": "待接受",
    "4": "被拒绝",
}


task_log_field={
    "actualFinishDate":"实际完成时间",
    "delete":"删除",
    "name":"任务名称",
    "ownerId":"负责人",
    "planFinishDate":"计划完成时间",
    "planStartDate":"计划开始时间",
    "status":"任务状态",
    "updatedAt":"更新时间",
    "updatedBy":"更新操作人",
    "updatedBy-label":"更新操作人标签"
}

# 销售易配置
grant_type = "password"
client_id = "2bcb9662ae9f2048431b58fdc5789394"
client_secret = "e7b96e5c62022780d455bceb9267673f"
redirect_uri = "https://www.istarshine.com/"
username = "Alan.Zhu@istarshine.com"
password = "admin000000K8HwLIxe"


# 工作台任务统计页面
work_count_type={
    "0":"account_num",
    "1":"opp_num",
    "2":"approve_num",
    "3":"order_num",
    "4":"order_back_num",
    "5":"wechat_group",
    "6":"wechat_message_num",
    "7":"kpi_num",
    "8":"visit_num",
    "9":"phone_num",
    "10":"ms_num",
    "11": "act_account_num"

}